[
  {
    "id": 1,
    "title": "HTML Explanation",
    "date": "2020",
    "detail": "HTML",
    "description": "HTML generally known as HyperText Markup Language, is the set of markup symbols or codes inserted into a file intended for display on internet. The markup tells web browsers how to display a web page's words and images (and much more actually). To be understanding about HTML lets dive through to one of the example of HTML  \n \n HTML started with type declaring that written as <!DOCTYPE HTML> followed by <html>, <head>, and <body>. From this part we may see similiarities between those code, thats are the mark up (written by < and >). "
  },
  {
    "id": 2,
    "title": "Australia to start November with a heatwave as La Niña chances dwindle",
    "date": "2022",
    "detail": "Weather",
    "description": "Australia's slow spring is finally receiving a boost of warmth, as part of the country is set to kick off November with widespread above-average temperatures.\n\nSydney and Canberra are forecast to hit 31C on Sunday, while Adelaide could reach a high of 33C.\n\nMelbourne will experience a warm spell over the weekend with temperatures reaching 27C, while Brisbane's temperatures are expected to hover around 30C starting Thursday.\n\nPerth is beginning to feel the heat but will experience a sharp drop in temperatures after Saturday.\n\nA chart displaying the 7-day temperatures for Sydney, Melbourne, Brisbane, Perth, Adelaide, and Canberra from 30 October to 6 November.\n\nSweltering heat sweeps across Australia as November approaches. Source: SBS News\n\nWeatherzone meteorologist Ben Domensino said this surge of hot air has been building since the end of October.\n\n'A stubborn ridge of high pressure to the south of Australia has been allowing hot air to build over the country's north-west in the final days of October,' he said.\n\nThe heat will continue to build over northwestern Australia in the coming days before a cold front moves through southern Australia, dragging the hot air to the east coast.\n\nAs the cold air advances, it forces the warmer air upward, potentially causing a rapid increase in temperatures in the affected areas.\n\nThe Bureau of Meteorology (BoM) has issued a warning for strong wind gusts expected to impact parts of 'NSW', Victoria, and Queensland until the end of Wednesday.\n\nResidents are advised to remain vigilant regarding fire danger, as the combination of rising temperatures and strengthening winds may affect South Australia and Victoria over the weekend.\n\n'The highest temperatures over the next 10 days are likely to occur in central and northwestern Australia, where some places could reach the mid-forties,' Domensino said.\n\nHe said parts of 'NSW', Queensland, South Australia, Northern Territory, and Western Australia are expected to exceed 40C this week.\n\nA second wave of heat is anticipated to drift across central and southern Australia next week.\n\nCould Australia face a La Niña summer? Here's what's predicted\n\nIs a La Niña event on the horizon?\n\nThe BoM has had a La Niña 'watch' in place since May, indicating that such an event has typically developed around 50 per cent of the time in the past.\n\nHowever, climatologist Zhi-Wen Chua from the BoM told SBS News that the chances of La Niña developing this year are lower than those observed in early September.\n\n'There are signs that La Niña may develop later this year, but there's no guarantee it will develop. We’ve also noticed that the chance of a La Niña event developing this year is less than what we saw at the start of spring.'\n\nEven if La Niña does develop, the BoM anticipates it will be relatively weak and short-lived.\n\nIf it does come into effect, Australia can expect to see increased rainfall and cooler daytime temperatures from mid-November through early December.\n\nThis pattern also typically brings a higher likelihood of tropical cyclones, a greater risk of flooding, and an earlier onset of the monsoon season."
  }
]
