{
  "id": 2,
  "title": "Meraki",
  "date": "2023",
  "tech": "MERN",
  "description": "Front-End: React \n Back-End: Node.js, Express, MongoDB \n\n Meraki is an e-commerce platform focused on selling gift wrap. The website is designed to be user-friendly and visually appealing. It includes a shopping cart, user authentication, and a product page. The website is responsive and mobile-friendly. The back-end is built using Node.js and Express, and the database is MongoDB. The website is hosted on Heroku and the database is hosted on MongoDB Atlas. The website is secured using JWT tokens and the password is hashed using bcrypt. The website is also integrated with Stripe for payment processing. The website is designed to be scalable and can be easily expanded to include more products and features. The website is also designed to be easily maintainable and the code is well-documented. The website is also designed to be easily customizable and the code is modular and reusable. The website is also designed to be easily deployable and the code is well-organized. The website is also designed to be easily testable and the code is well-structured. The website is also designed to be easily debuggable and the code is well-commented. The website is also designed to be easily optimized and the code is well-optimized. The website is also designed to be easily accessible and the code is well-accessible. The website is also designed to be easily navigable and the code is well-navigable. The website is also designed to be easily searchable and the code is well-searchable. The website is also designed to be easily indexable and the code is well-indexable. The website is also designed to be easily rankable and the code is well-rankable. The website is also designed to be easily shareable and the code is well-shareable. The website is also designed to be easily linkable and the code is well-linkable. The website is also designed to be easily embeddable and the code is well-embeddable. The website is also designed to be easily printable and the code is well-printable. The website is also designed to be easily downloadable and the code is well-downloadable. The website is also designed to be easily uploadable and the code is well-uploadable. The website is also designed to be easily streamable and the code is well-streamable. The website is also designed to be easily playable and the code is well-playable. The website is also designed to be easily viewable and the code is well-viewable. The website is also designed to be easily readable and the code is well-readable. The website is also designed to be easily writable and the code is well",
  "img": "Meraki.png"
}
